porousVent/grillcases/grill_source_refinMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       516;
    }
    topAndBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       666;
    }
    inlet
    {
        type            patch;
        nFaces          9;
        startFace       816;
    }
    outlet
    {
        type            patch;
        nFaces          9;
        startFace       825;
    }
)

// ************************************************************************* //
