porousVent/grillcases/grill_source_refinMesh/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.setporous;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    porous_block;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (1 0 0) (1.1 0.6 0.6);
        }
    }

    {
    name porous_block_zone;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    	{
        set porous_block;
    	}
    }

);

// ************************************************************************* //
