porousVent/grillcases/grill_source_refinMesh/system/topoSetDict.n
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.n;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    porous_block;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.89 0 0) (1.21 0.6 0.6);
        }
    }


);

// ************************************************************************* //
